In [ ]:
import pandas as pd
import numpy as np
state_df = pd.read_csv(r"D:\EV_Market_Analysis_India\data\raw\electric_vehicle_sales_by_state.csv")
maker_df = pd.read_csv(r"D:\EV_Market_Analysis_India\data\raw\electric_vehicle_sales_by_makers.csv")
date_df = pd.read_csv(r"D:\EV_Market_Analysis_India\data\raw\dim_date.csv")

In [71]:
state_df['date'] = pd.to_datetime(state_df['date'], format='%d-%b-%y')
maker_df['date'] = pd.to_datetime(maker_df['date'], format='%d-%b-%y')
date_df['date']  = pd.to_datetime(date_df['date'], format='%d-%b-%y')

In [72]:
state_df = state_df.merge(date_df, on='date', how='left')
maker_df = maker_df.merge(date_df, on='date', how='left')

In [73]:
state_df['penetration_rate'] = (
    state_df['electric_vehicles_sold'] / state_df['total_vehicles_sold']
) * 100

In [ ]:
state_df.to_csv(r"D:\EV_Market_Analysis_India\data\processed\ev_state_cleaned.csv", index=False)
maker_df.to_csv(r"D:\EV_Market_Analysis_India\data\processed\ev_maker_cleaned.csv", index=False)

In [76]:
state_224_df = state_df[state_df['fiscal_year'].isin([2022, 2023, 2024])]

In [77]:
state_2024_df = state_224_df[state_224_df['fiscal_year'] == 2024]
state_summary_2024 = (
    state_2024_df
    .groupby('state', as_index=False)
    .agg(
        total_ev_sold=('electric_vehicles_sold', 'sum'),
        total_vehicles_sold=('total_vehicles_sold', 'sum')
    )
)

In [78]:
state_summary_2024['penetration_rate'] = (
    state_summary_2024['total_ev_sold'] /
    state_summary_2024['total_vehicles_sold']
) * 100

In [79]:
top_5_states = state_summary_2024.sort_values(
    by='penetration_rate', ascending=False
)
top_5_states.head(5)

          state  total_ev_sold  total_vehicles_sold  penetration_rate
10          Goa          10799                78524         13.752483
17       Kerala          73938               638114         11.586958
16    Karnataka         160989              1581988         10.176373
20  Maharashtra         197169              2293994          8.595009
9         Delhi          46724               606348          7.705806

In [80]:
bottom_5_states = state_summary_2024.sort_values(
    by='penetration_rate', ascending=True
)
bottom_5_states.head(5)

                state  total_ev_sold  total_vehicles_sold  penetration_rate
29             Sikkim              0                10518          0.000000
24           Nagaland              9                16972          0.053029
3   Arunachal Pradesh             31                27892          0.111143
0   Andaman & Nicobar              2                  660          0.303030
22          Meghalaya            133                36628          0.363110

In [81]:
state_summary_2024[
    state_summary_2024['state'].isin(['Delhi', 'Karnataka'])
]

        state  total_ev_sold  total_vehicles_sold  penetration_rate
9       Delhi          46724               606348          7.705806
16  Karnataka         160989              1581988         10.176373

In [82]:
state_yearly = (
    state_224_df
    .groupby(['state', 'fiscal_year'], as_index=False)
    .agg(
        ev_sold=('electric_vehicles_sold', 'sum'),
        total_sold=('total_vehicles_sold', 'sum')
    )
)
state_yearly['penetration_rate'] = (
    state_yearly['ev_sold'] / state_yearly['total_sold']
) * 100

In [83]:
pivot_penetration = state_yearly.pivot(
    index='state',
    columns='fiscal_year',
    values='penetration_rate'
).reset_index()

In [84]:
declining_states = pivot_penetration[
    pivot_penetration[2024] < pivot_penetration[2022]
]

declining_states

Empty DataFrame
Columns: [state, 2022, 2023, 2024]
Index: []

In [ ]:
state_summary_2024.to_csv(r"D:\EV_Market_Analysis_India\output\state_penetration_summary_2024.csv", index=False)

In [86]:
maker_2324_df = maker_df[maker_df['fiscal_year'].isin([2023, 2024])]

In [87]:
maker_2w_df = maker_2324_df[maker_2324_df['vehicle_category'] == '2-Wheelers']

In [88]:
maker_2023 = maker_2w_df[maker_2w_df['fiscal_year'] == 2023]

maker_summary_2023 = (
    maker_2023
    .groupby('maker', as_index=False)
    .agg(total_ev_sold=('electric_vehicles_sold', 'sum'))
)

In [89]:
top_3_makers_2023 = maker_summary_2023.sort_values(
    by='total_ev_sold', ascending=False
)
top_3_makers_2023.head(3)

           maker  total_ev_sold
8   OLA ELECTRIC         152583
7        OKINAWA          96945
4  HERO ELECTRIC          88993

In [90]:
bottom_3_makers_2023 = maker_summary_2023.sort_values(
    by='total_ev_sold', ascending=True
)
bottom_3_makers_2023.head(3)

       maker  total_ev_sold
5   JITENDRA           8563
3      BEING          11018
10   PURE EV          11556

In [91]:
maker_2024 = maker_2w_df[maker_2w_df['fiscal_year'] == 2024]

maker_summary_2024 = (
    maker_2024
    .groupby('maker', as_index=False)
    .agg(total_ev_sold=('electric_vehicles_sold', 'sum'))
)

In [92]:
top_3_makers_2024 = maker_summary_2024.sort_values(
    by='total_ev_sold', ascending=False
)
top_3_makers_2024.head(3)

           maker  total_ev_sold
9   OLA ELECTRIC         322489
12           TVS         180743
1          ATHER         107552

In [93]:
bottom_3_makers_2024 = maker_summary_2024.sort_values(
    by='total_ev_sold', ascending=True
)
bottom_3_makers_2024.head(3)

              maker  total_ev_sold
3   BATTRE ELECTRIC           4841
11           REVOLT           7254
6     KINETIC GREEN           9585

In [94]:
maker_4w_df = maker_2324_df[maker_2324_df['vehicle_category'] == '4-Wheelers']

In [95]:
maker_4w_summary = (
    maker_4w_df
    .groupby(['maker', 'fiscal_year'], as_index=False)
    .agg(total_ev_sold=('electric_vehicles_sold', 'sum'))
)

In [ ]:
maker_summary_2023.to_csv(r"D:\EV_Market_Analysis_India\output\maker_2w_summary_2023.csv", index=False)
maker_summary_2024.to_csv(r"D:\EV_Market_Analysis_India\output\maker_2w_summary_2024.csv", index=False)
maker_4w_summary.to_csv(r"D:\EV_Market_Analysis_India\output\maker_4w_yearly_summary.csv", index=False)

In [98]:
maker_4w_224_df = maker_df[
    (maker_df['vehicle_category'] == '4-Wheelers') &
    (maker_df['fiscal_year'].isin([2022, 2024]))
]

In [101]:
maker_4w_sales = (
    maker_4w_224_df
    .groupby(['maker', 'fiscal_year'], as_index=False)
    .agg(total_ev_sold=('electric_vehicles_sold', 'sum'))
)
maker_4w_sales

                  maker  fiscal_year  total_ev_sold
0             BMW India         2022              7
1             BMW India         2024           1078
2             BYD India         2022             33
3             BYD India         2024           1466
4         Hyundai Motor         2022            110
5         Hyundai Motor         2024           1390
6            KIA Motors         2022              0
7            KIA Motors         2024            328
8              MG Motor         2022           1647
9              MG Motor         2024           8829
10  Mahindra & Mahindra         2022           4042
11  Mahindra & Mahindra         2024          23346
12    Mercedes -Benz AG         2022             26
13    Mercedes -Benz AG         2024            291
14      PCA Automobiles         2022              0
15      PCA Automobiles         2024           1533
16          Tata Motors         2022          12708
17          Tata Motors         2024          48181
18     Volvo Auto India         2022              4
19     Volvo Auto India         2024            459

In [102]:
maker_4w_pivot = maker_4w_sales.pivot(
    index='maker',
    columns='fiscal_year',
    values='total_ev_sold'
).reset_index()
maker_4w_pivot

fiscal_year                maker   2022   2024
0                      BMW India      7   1078
1                      BYD India     33   1466
2                  Hyundai Motor    110   1390
3                     KIA Motors      0    328
4                       MG Motor   1647   8829
5            Mahindra & Mahindra   4042  23346
6              Mercedes -Benz AG     26    291
7                PCA Automobiles      0   1533
8                    Tata Motors  12708  48181
9               Volvo Auto India      4    459

In [103]:
maker_4w_pivot = maker_4w_pivot[
    (maker_4w_pivot[2022] > 0) & (maker_4w_pivot[2024] > 0)
]

In [ ]:
maker_4w_pivot['CAGR_4W'] = (
    (maker_4w_pivot[2024] / maker_4w_pivot[2022]) ** (1/2) - 1
)
maker_4w_pivot['CAGR_4W_pct'] = maker_4w_pivot['CAGR_4W'] * 100

In [108]:
top_5_cagr_4w = maker_4w_pivot.sort_values(
    by='CAGR_4W_pct', ascending=False
)
top_5_cagr_4w.head(5)

fiscal_year              maker  2022  2024    CAGR_4W  CAGR_4W_pct
0                    BMW India     7  1078  11.409674  1140.967365
9             Volvo Auto India     4   459   9.712143   971.214264
1                    BYD India    33  1466   5.665151   566.515134
2                Hyundai Motor   110  1390   2.554766   255.476633
6            Mercedes -Benz AG    26   291   2.345491   234.549065

In [ ]:
top_5_cagr_4w.to_csv(r"D:\EV_Market_Analysis_India\output\maker_4w_cagr_2022_2024.csv", index=False)

In [110]:
seasonality_df = state_df[
    state_df['fiscal_year'].isin([2022, 2023, 2024])
]

In [111]:
seasonality_df['month'] = seasonality_df['date'].dt.month
seasonality_df['month_name'] = seasonality_df['date'].dt.month_name()

In [113]:
monthly_ev_sales = (
    seasonality_df
    .groupby(['month', 'month_name'], as_index=False)
    .agg(total_ev_sold=('electric_vehicles_sold', 'sum'))
)

In [114]:
monthly_ev_sales = monthly_ev_sales.sort_values('month')
monthly_ev_sales

    month month_name  total_ev_sold
0       1    January         189099
1       2   February         198049
2       3      March         291587
3       4      April         134657
4       5        May         159869
5       6       June         106709
6       7       July         127426
7       8     August         141961
8       9  September         145972
9      10    October         185185
10     11   November         205196
11     12   December         180401

In [115]:
monthly_ev_sales.sort_values(
    by='total_ev_sold', ascending=False
).head(3)

    month month_name  total_ev_sold
2       3      March         291587
10     11   November         205196
1       2   February         198049

In [116]:
monthly_ev_sales.sort_values(
    by='total_ev_sold', ascending=True
).head(3)

   month month_name  total_ev_sold
5      6       June         106709
6      7       July         127426
3      4      April         134657

In [ ]:
monthly_ev_sales.to_csv(r"D:\EV_Market_Analysis_India\output\monthly_ev_sales_trends.csv", index=False)

In [118]:
state_ev_yearly = (
    state_df[state_df['fiscal_year'].isin([2022, 2024])]
    .groupby(['state', 'fiscal_year'], as_index=False)
    .agg(ev_sold=('electric_vehicles_sold', 'sum'))
)

In [119]:
state_ev_pivot = state_ev_yearly.pivot(
    index='state',
    columns='fiscal_year',
    values='ev_sold'
).reset_index()

In [120]:
state_ev_pivot = state_ev_pivot[
    (state_ev_pivot[2022] > 0) & (state_ev_pivot[2024] > 0)
]

In [121]:
state_ev_pivot['CAGR'] = (
    (state_ev_pivot[2024] / state_ev_pivot[2022]) ** (1/2) - 1
)

In [122]:
top_10_states = state_summary_2024.sort_values(
    by='penetration_rate', ascending=False
).head(10)

In [123]:
projection_df = top_10_states.merge(
    state_ev_pivot[['state', 'CAGR']],
    on='state',
    how='left'
)

In [124]:
projection_df['projected_ev_sales_2030'] = (
    projection_df['total_ev_sold'] * (1 + projection_df['CAGR']) ** 6
)
projection_df['projected_ev_sales_2030'] = projection_df['projected_ev_sales_2030'].round(0)

In [125]:
projection_df[
    ['state', 'total_ev_sold', 'CAGR', 'projected_ev_sales_2030']
]

          state  total_ev_sold      CAGR  projected_ev_sales_2030
0           Goa          10799  1.464483                2419574.0
1        Kerala          73938  1.328320               11779401.0
2     Karnataka         160989  0.932431                8383406.0
3   Maharashtra         197169  1.018893               13351146.0
4         Delhi          46724  0.681001                1054259.0
5    Chandigarh           2877  1.645751                 986811.0
6        Odisha          39118  1.029421                2732814.0
7  Chhattisgarh          28540  1.508917                7118219.0
8    Tamil Nadu          94314  0.599531                1579547.0
9    Puducherry           3098  1.054436                 232936.0

In [ ]:
projection_df.to_csv(r"D:\EV_Market_Analysis_India\output\state_ev_sales_projection_2030.csv", index=False)

In [127]:
revenue_df = (
    state_df[state_df['fiscal_year'].isin([2022, 2023, 2024])]
    .groupby(['fiscal_year', 'vehicle_category'], as_index=False)
    .agg(ev_units=('electric_vehicles_sold', 'sum'))
)

In [128]:
revenue_df['avg_price'] = revenue_df['vehicle_category'].map({
    '2-Wheelers': 100000,
    '4-Wheelers': 1500000
})

In [129]:
revenue_df['revenue'] = revenue_df['ev_units'] * revenue_df['avg_price']
revenue_df

   fiscal_year vehicle_category  ev_units  avg_price       revenue
0         2022       2-Wheelers    252573     100000   25257300000
1         2022       4-Wheelers     18577    1500000   27865500000
2         2023       2-Wheelers    727903     100000   72790300000
3         2023       4-Wheelers     47465    1500000   71197500000
4         2024       2-Wheelers    932692     100000   93269200000
5         2024       4-Wheelers     86901    1500000  130351500000

In [130]:
revenue_pivot = revenue_df.pivot(
    index='vehicle_category',
    columns='fiscal_year',
    values='revenue'
).reset_index()

In [131]:
revenue_pivot['growth_22_24_pct'] = (
    (revenue_pivot[2024] - revenue_pivot[2022]) / revenue_pivot[2022]
) * 100
revenue_pivot['growth_23_24_pct'] = (
    (revenue_pivot[2024] - revenue_pivot[2023]) / revenue_pivot[2023]
) * 100

In [ ]:
revenue_pivot.to_csv(r"D:\EV_Market_Analysis_India\output\ev_revenue_growth_summary.csv", index=False)